# Core
brew "git"
brew "zsh"
brew "tmux"
brew "neovim"
brew "starship"

# Search & navigation
brew "fzf"
brew "ripgrep"

# Languages & runtimes
brew "python"
brew "go"
brew "node"
brew "lua"

# Language servers
brew "pyright"
brew "gopls"
brew "lua-language-server"
brew "typescript-language-server"
brew "terraform-ls"

# Cloud & infrastructure
brew "google-cloud-sdk"
brew "kubectl"
brew "terraform"
brew "docker"

# Build tools
brew "gcc"
brew "curl"

# Terminal
cask "ghostty"
